src/main/resources/xml/not-used/sample.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:v2="http://www.huawei.com.cn/schema/common/v2_1"
                  xmlns:v1="http://www.csapi.org/schema/authorization/local/v1_0">
    <soapenv:Header>
        <v2:RequestSOAPHeader>
            <v2:spId>2340110000470</v2:spId>
            <v2:spPassword>98e1b297bd4a7bd4b043c9ff745a6a83</v2:spPassword>
            <v2:timeStamp>20180101010101</v2:timeStamp>
            <v2:serviceId>234012000009801</v2:serviceId>
        </v2:RequestSOAPHeader>
    </soapenv:Header>
    <soapenv:Body>
        <v1:authorization>
            <v1:endUserIdentifier>2347033590787</v1:endUserIdentifier>
            <v1:transactionId>0190134091410999</v1:transactionId>
            <v1:serviceId>234012000009801</v1:serviceId>
            <v1:scope>17</v1:scope>
            <v1:amount>100</v1:amount>
            <v1:currency>NGN</v1:currency>
            <v1:contentId/>
            <v1:frequency>0</v1:frequency>
            <v1:description>payment service</v1:description>
            <v1:notificationURL>http://10.199.198.68:9020/SPnotify</v1:notificationURL>
            <v1:tokenValidity>1</v1:tokenValidity>
            <v1:extensionInfo>
                <item>
                    <key>productName</key>
                    <value>CRBT sub</value>
                </item>
                <item>
                    <key>totalAmount</key>
                    <value>10</value>
                </item>
                <item>
                    <key>channel</key>
                    <value>2</value>
                </item>
                <item>
                    <key>serviceInterval</key>
                    <value>5</value>
                </item>
                <item>
                    <key>serviceIntervalUnit</key>
                    <value>3</value>
                </item>
                <item>
                    <key>tokenType</key>
                    <value>0</value>
                </item>
            </v1:extensionInfo>
        </v1:authorization>
    </soapenv:Body>
</soapenv:Envelope>